-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 04, 2025 at 11:41 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `poems`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `ID` int(11) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `errors`
--

CREATE TABLE `errors` (
  `errors` int(11) NOT NULL,
  `type` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `maintable`
--

CREATE TABLE `maintable` (
  `ID` int(11) NOT NULL,
  `content` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` int(11) NOT NULL DEFAULT 0 COMMENT '0 not Approve, 1 Approved'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `maintable`
--

INSERT INTO `maintable` (`ID`, `content`, `status`) VALUES
(2, 'هز الجذوع وحرك الأغصانا * للدين في صدر الشهيد مكانا', 1),
(3, 'لن تبسم بعد مقارعتي * وستمضي عمرك عباسا', 1),
(4, 'تائه أين السبيل * غرك الأمل الطويل', 1),
(5, 'فقلقلت بالهم الذي قلقل الحشى * قلاقل عيس كلهن قلاقل', 1),
(6, 'أثافي سفعا في معرس مرجل * ونؤيا كجذم الحوض لم يتثلم', 1),
(7, 'فلما أنخنا ركزنا الرماح * فوق مكارمنا والعلا', 1),
(8, 'هل من طبيب لداء الحب أو راقي * يشفي عليلا أخا حب وإيراقي', 1),
(9, 'حزن براني وأشواق رعت كبدي * يا ويح نفسي من حزن وأشواق', 1),
(10, 'قد كان أبقى الهوى من مهجتي رمقًا * حتى أتى البين فاستولى على الباقي', 1),
(11, 'أكلف النفس صبرا وهي جازعة * والصبر في الحب أعيا كل مشتاق', 1),
(12, 'وخلتهم سهاما صائبات * فكانوها ولكن في فؤادي', 1),
(13, 'وإخوان حسبتهموا دروعا * فكانوها ولكن للأعادي', 1),
(14, 'شربنا وأهرقنا على أرض جرعة * وللأرض من كأس الكرام نصيب', 1),
(15, 'شربنا شرابا طيبا عند طيب * كذاك شراب الطيبين يطيب', 1),
(16, 'لا بد للضيق بعد اليأس من فرج * وكل داجية يوماً لاشراق', 1),
(17, 'يا قلب صبراً جميلاً انه قدر * يجري على المرء من اسر واطلاق', 1),
(18, 'وهون الخطب عندي انني رجل * لاق من الدهر ما كل امرئ لاقي', 1),
(19, 'اسلمت نفسي لمولى لا يخيب له * راج على الدهر والمولى هو الواقي', 1),
(20, 'فلا يعبني حسود ان جرى قدر * فليس لي غير ما يقضيه خلاقي', 1),
(21, 'علي شيم الغوادي كلما برقت * وما علي اذا ضنت برقراق', 1),
(22, 'والمرء طوع الليالي في تصرفها * لا يملك الامر من نجح واخفاق', 1),
(23, 'عصر تولى وابقى في الفؤاد هوى * يكاد يشمل احشائي باحراق', 1),
(24, 'فيا لها ذكرة شب الغرام بها * ناراً سرت بين ارداني واطواقي', 1),
(25, 'اذكرتني ما مضى والشمل مجتمع * بمصر والحرب لم تنهض على ساق', 1),
(26, 'وانت يا طائراً يبكي على فنن * نفسي فداؤك من ساق على ساق', 1),
(27, 'وان مررت على المقياس فاهد له * مني تحية نفس ذات اعلاق', 1),
(28, 'فيا بريد الصبا بلغ ذوي رحمي * اني مقيم على عهدي وميثاقي', 1),
(29, 'إذا تذكرت اياماً بهم سلفت * تحدرت بغروب الدمع آماقي', 1),
(30, 'وكيف أنسى دياراً قد تركت بها * اهلاً كراماً لهم ودي واشفاقي', 1),
(31, 'أصبو اليها على بعد ويعجبني * اني اعيش بها في ثوب املاق', 1),
(32, 'مرعى جيادي ومأوى جيرتي وحمى * قومي ومنبت آدابي واعراقي', 1),
(33, 'ولا برحت من الاوراق في حلل * من سندس عبقري الوشي براق', 1),
(34, 'كأن نجم الثريا وهو مضطرب * دون الهلال سراج لاح في طاق', 1),
(35, 'بل حبذا دوحة تدعو الهديل بها * عند الصباح قماري باطواق', 1),
(36, 'يا حبذا نسم من جوها عبق * يسري على جدول بالماء دفاق', 1),
(37, 'يا روضة النيل لا مستك بائقة * ولا عدتك سماء ذات اغداق', 1),
(38, 'أيام اسحب اذيا ل الصبا مرحاً * في فتية لطريق الخير سباق', 1),
(39, 'لا في سرنديب لي خل ألوذ به * ولا أنيس سوى همي وإطراقي', 1),
(40, 'تقلدت من جمان الشهب منطقة * معقودة بوشاح غير مقلاق', 1),
(41, 'أبيت أرعى نجوم الليل مرتفقا * في قنة عز مرقاها على الراقي', 1),
(42, 'كل المصيبات إن جلت وإن عظمت * إلا المصيبات في دين الفتى جلل', 1),
(43, 'كل شيء ما عدى الله جلل * والفتى يسعى ويلهيه الأمل', 1),
(44, 'إن الفقيه هو الفقير * وإنما راء الفقير تجمعت أطرافها', 1),
(45, 'إن بيني وبينهم إخاء * وعزيز علي ترك الإخاء', 1),
(46, 'فإذا تملكت اللئام * فإن موت الحر أحرى', 1),
(47, 'بين السيوف وعينيه مشاركه * من أجلها قبل للأغماد أجفان', 1),
(48, 'وإني لأرعاكم على القرب والنوى * وأذكركم بين القنا والقنابل', 1),
(49, 'ذكرتك والخطي يخطر بيننا * وقد نهلت منا المثقفة السمر', 1),
(50, 'امتلأ الحوض وقال قطني * مهلا رويدا قد ملأت بطني', 1),
(51, 'وكن عن الراحة في معزل * فالصفع موجود مع الراحة', 1),
(52, 'قلت للفقر أين أنت مقيم * قال في عمائم الفقهاء', 1),
(53, 'ولقد ذكرتك والرماح نواهل مني * وسيف الهند تقطر من دمي', 1),
(54, 'علامة الحب أن تستصغر الخطر * وأن تزور ونار الحب تستعر', 1),
(55, 'وترجع أعقاب الرماح سليمة * وقد حطمت في الدارعين العوامل', 1),
(56, 'فإن كنت تبغي العز فابغ توسطا * فعند التناهي يقصر المتطاول', 1),
(57, 'توقى البدور النقص وهي أهلة * ويدركها النقصان وهي كوامل', 1),
(58, 'تقتك على أكتاف أبطالها القنا * وهابتك في أغمادهن المناصل', 1),
(59, 'إذا أنت أعطيت السعادة لم تبل * وإن نظرت شزرا إليك القبائل', 1),
(60, 'وإن سدد الأعداء نحوك أسهما * نكصن على أفواقهن المعابل', 1),
(61, 'تحامى الرزايا كل خف ومنسم * وتلقى رُداهن الذرى والكواهِل', 1),
(62, 'كأن الثريا والصباح يروعها * أخو سقطة أو ظالع متحامل', 1),
(63, 'إذا اشتاقت الخيل المناهل أعرضت * عن الماء فاشتاقت إليها المناهل', 1),
(64, 'كأن الصبا ألقت إلي عنانها * تخب بسَرجي مرة وتناقل', 1),
(65, 'كأن دجاه الهجر والصبح موعد * بوصْل وضوء الفجر حب مماطل', 1),
(66, 'قطعت به بحرا يعب عبابه * وليس له إلا التبلج ساحل', 1),
(67, 'من الزنج كهل شاب مفرق رأسه * وأوثق حتى نهضه متثاقل', 1),
(68, 'وليلان حال بالكواكب جوزه * وآخر من حلي الكواكب عاطل', 1),
(69, 'ويؤنسني في قلب كل مخوفة * حليف سرى لم تصح منه الشمائل', 1),
(70, 'وقد أغتدي والليل يبكي تأسفا * على نفسه والنجم في الغرب مائل', 1),
(71, 'فيا موت زر إن الحياة ذميمة * ويا نفس جدي إن دهرك هازل', 1),
(72, 'وطاولت الأرض السماء سفاهة * وفاخرت الشهب الحصى والجَنادل', 1),
(73, 'وقال السها للشمس أنت خفية * وقال الدجى يا صبح لونك حائل', 1),
(74, 'ينافس يومي فيّ أمسي تشرفا * وتحسد أسحاري علي الأصائل', 1),
(75, 'إذا وصف الطائي بالبخل مادر * وعيّر قسا بالفهاهة باقل', 1),
(76, 'بريح أعيرت حافرا من زبرجد * لها التبر جسم واللجين خلاخل', 1),
(77, 'ولما رأيت الجهل في الناس فاشيا * تجاهلت حتى ظن أني جاهل', 1),
(78, 'فلو بان عضدي ما تأسف منكبي * ولو مات زندي ما بكت الأنامل', 1),
(79, 'وكيف تنام الطير في وكناتها * وقد نصبت للفَرقدين الحبائل', 1),
(80, 'لدى موطن يشتاقه كل سيد * ويقصر عن إدراكه المتناول', 1),
(81, 'وطال اعترافي بالزمان وصرفه * فلست أبالي من تغول الغوائل', 1),
(82, 'فواعجبا كم يدعي الفضل ناقص * وواسفا كم يظهر النقص فاضل', 1),
(83, 'ولي منطق لم يرض لي كنه منزلي * على أنني بين السماكين نازل', 1),
(84, 'وإن كان في لبس الفتى شرف له * فما السيف إلا غمده والحمائل', 1),
(85, 'وإني جواد لم يحل لجامه * ونضو يمان أغفلته الصياقل', 1),
(86, 'وأغدو ولو أن الصباح صوارم * وأسري ولو أن الظلام جحافل', 1),
(87, 'يهم الليالي بعض ما أنا مضمر * ويثقل رضوى دون ما أنا حامل', 1),
(88, 'وإني وإن كنت الأخير زمانه * لآت بما لم تستطعه الأوائل', 1),
(89, 'وقد سار ذكري في البلاد فمن لهم * بإخفاء شمس ضوؤها متكامل', 1),
(90, 'إذا هبت النكباء بيني وبينكم * فأهون شيء ما تقول العواذل', 1),
(91, 'كأني إذا طلت الزمان وأهله * رجعت وعندي للأنام طوائل', 1),
(92, 'أقل صدودي أنني لك مبغض * وأيسر هجري أنني عنك راحل', 1),
(93, 'أعندي وقد مارست كل خفية * يصدق واش أو يخيب سائل', 1),
(94, 'تعد ذنوبي عند قوم كثيرة * ولا ذنب لي إلا العلى والفواضل', 1),
(95, 'ألا في سبيل المجد ما أنا فاعل * عفاف وإقدام وحزم ونائل', 1),
(96, 'إذا استوت الأسافل والأعالي * فقد طابت منادبة المنايا', 1),
(97, 'وإن ترفع الوضعاء يوما * على الرفعاء من إحدى البلايا', 1),
(98, 'ومن يثني الأصاغر عن مراد * إذا جلس الأكابر في الزوايا', 1),
(99, 'متى يصل العطاش إلى ارتواء * إذا استقت البحار من الركايا', 1),
(100, 'هذا الذي تعرف البطحاء وطأته * والبيت يعرفه والحل والحرم', 1),
(101, 'ما زلت تلهج بالتاريخ تكتبه * حتى وجدناك في التاريخ مكتوبا', 1),
(102, 'الجوع يطرد بالرغيف اليابس * فعلام تكثر حسرتي ووساوسي', 1),
(103, 'إذا ما زاد عمرك زاد نقصا * فنقصان الحياة من التمام', 1),
(104, 'أيقنت أن المستحيل ثلاثة * الغول والعنقاء والخل الوفي', 1),
(105, 'حكم المنية في البرية ساري * ما هذه الدنيا بدار قرار', 1),
(106, 'لما رأيت بني الدنيا وما بهم * خل وفي للشدائد أصطفي', 1),
(107, 'وليس يصح في الأذهان شيء * إذا احتاج النهار إلى دليل', 1),
(108, 'وقد كانوا إذا عدوا قليلا * فقد صاروا أقل من القليل', 1),
(109, 'وجربنا وجرب أولونا * فما شيء أعز من الوفاء', 1),
(110, 'وما يبكون مثل أخي ولكن * أعزي النفس عنه بالتسلي', 1),
(111, 'ولولا كثرة الباكين حولي * على إخوانهم لقتلت نفسي', 1),
(112, 'يذكرني  طلوع الشمس صخرا * وأذكره لكل غروب شمس', 1),
(113, 'ذهب الذي اليعاش في أكنافهم * وبقيت في خلف كجلد الأجرب', 1),
(114, 'أي يومي من الموت أفر * يوم لا يقدر أو يوم قدر', 1),
(115, 'وذلك أنه لما تبدى * وأبصر وجهك استحيا فغابا', 1),
(116, 'يوم لا يقدر لا أرهبه * ومن المقدور لا ينجو الحذر', 1),
(117, 'أرى بدر الزمان يلوح حينا * فيبدو ثم يلتحف السحابا', 1),
(118, 'مر الجراد على زرعي فقلت له * إلزم مكانك لا تولع بإفساد', 1),
(119, 'ويلاه إن نظرت وإن هي أعرضت * وقع السهام ونزعهن أليم', 1),
(120, 'فإن تسلمي نسلم وإن تتنصري * يخط رجال بين أعينهم صلبا', 1),
(121, 'أحب بني العوام طرا لأجلها * ومن أجلها أحببت أخوالها كلبا', 1),
(122, 'ينام بإحدى مقلتي ويتقي * بأخرى المنايا فهو يقظان نائم', 1),
(123, 'فقام منهم خطيب فوق سنبلة * إنا على سفر لا بد من زاد', 1),
(124, 'توكل على الرحمن في كل حاجة * ولا تؤثرن العجز يوما على الطلب', 1),
(125, 'ولا بد من شكوة إلى ذي مروءة * يواسيك أو يسليك أو يتوجع', 1),
(126, 'فإن كنت لا تدري فتلك مصيبة * وإن كنت تدري فالمصيبة أعظم', 1),
(127, 'ألم تر أن الله قال لمريم * إليك فهزي الجذع يساقط الرطب', 1),
(128, 'ولو شاء أن تجنيه من غير هزها * جنته ولكن كل شيء له سبب', 1),
(129, 'إن كنت لا تدري فتلك مصيبة * أو كنت تدري فالمصيبة أعظم', 1),
(130, 'وإن ألقاك فهمك في مهاو * فليتك ثم ليتك ما فهتما', 1),
(131, 'إذا ما لم يفدك العلم خيرا * فخير منه أن لو قد جهلتا', 1),
(136, 'لا تنتظر خصمًا أقل شجاعة * وارفع جبينك مثلما عودتنا', 1),
(137, 'شكوت إلى وكيع سوء حفظي * فأرشدي إلى ترك المعاصي', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `errors`
--
ALTER TABLE `errors`
  ADD PRIMARY KEY (`errors`),
  ADD KEY `contentIDConstructor` (`content`);

--
-- Indexes for table `maintable`
--
ALTER TABLE `maintable`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin`
--
ALTER TABLE `admin`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `errors`
--
ALTER TABLE `errors`
  MODIFY `errors` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `maintable`
--
ALTER TABLE `maintable`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=138;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `errors`
--
ALTER TABLE `errors`
  ADD CONSTRAINT `contentIDConstructor` FOREIGN KEY (`content`) REFERENCES `maintable` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
